Revit 2022 API
IndependentTag.LeaderEnd Property
 The position of the leader end for a tag using free end leader behavior.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Syntax
C#
[ObsoleteAttribute("This property is deprecated in Revit 2022 and will be removed in a later version of Revit. We suggest you use the `GetLeaderEnd(Reference)` or `SetLeaderEnd(Reference)` method instead.")]
public XYZ LeaderEnd { get; set; }
Visual Basic
<ObsoleteAttribute("This property is deprecated in Revit 2022 and will be removed in a later version of Revit. We suggest you use the `GetLeaderEnd(Reference)` or `SetLeaderEnd(Reference)` method instead.")> _
Public Property LeaderEnd As XYZ
	Get
	Set
Visual C++
[ObsoleteAttribute(L"This property is deprecated in Revit 2022 and will be removed in a later version of Revit. We suggest you use the `GetLeaderEnd(Reference)` or `SetLeaderEnd(Reference)` method instead.")]
public:
property XYZ^ LeaderEnd {
	XYZ^ get ();
	void set (XYZ^ value);
}
Remarks
 Tags with attached leaders or no leaders do not report leader ends. LeaderEndCondition for the tag's leader condition.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  There is no leader end because the tag does not use a free end leader.
See Also
IndependentTag Class
Autodesk.Revit.DB Namespace